Product/trunk/DDPs/Framework/IIS/xml/notify-AttributeValueChange.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:avc="http://www.tmforum.org/mtop/fmw/xsd/avc/v1" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1 ../xsd/HeaderDefinitions.xsd http://www.tmforum.org/mtop/fmw/xsd/avc/v1 ../xsd/EventAttributeValueChange.xsd http://www.tmforum.org/mtop/nrf/xsd/me/v1 ../../../NetworkResourceFulfillment/IIS/xsd/Me.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>NOTIFICATION</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>RPC</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <avc:attributeValueChange xmlns:m0="http://www.tmforum.org/mtop/fmw/xsd/avc/v1" xmlns:m1="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:m2="http://www.tmforum.org/mtop/fmw/xsd/ei/v1">
          <m1:notificationId>String</m1:notificationId>
          <m1:sourceTime>2001-12-17T09:30:47.0Z</m1:sourceTime>
          <m1:vendorExtensions/>
          <m2:objectType>ME</m2:objectType>
          <m2:objectName>
            <nam:object>
              <nam:type>MD</nam:type>
              <nam:name>Company/String</nam:name>
            </nam:object>
            <nam:object>
              <nam:type>ME</nam:type>
              <nam:name>String</nam:name>
            </nam:object>
          </m2:objectName>
          <m2:osTime>2001-12-17T09:30:47.0Z</m2:osTime>
          <m0:attributeList>
            <pre:userLabel xmlns:pre="unknown">String</pre:userLabel>
          </m0:attributeList>
          <m0:deletedAttributeList>
            <me:me xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1">
              <!-- an alias and vendor extension are deleted -->
              <coi:aliasNameList>
                <gen:alias>
                  <gen:aliasName>String</gen:aliasName>
                  <gen:aliasValue>String</gen:aliasValue>
                </gen:alias>
              </coi:aliasNameList>
              <coi:vendorExtensions>
                <nt:jane xmlns:nt="www.jane.com/mtosi/xsd/me">
                  <nt:att1>123</nt:att1>
                  <nt:att2>String</nt:att2>
                </nt:jane>
              </coi:vendorExtensions>
            </me:me>
          </m0:deletedAttributeList>
          <m0:setAttributeList>
            <me:me xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1">
              <!-- userLabel and owner are set -->
              <coi:userLabel>String</coi:userLabel>
              <coi:owner>String</coi:owner>
            </me:me>
          </m0:setAttributeList>
        </avc:attributeValueChange>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
